#include <stdio.h>
#include <stdlib.h>
#include <string.h>

static char college[200][50] = {
"北京大学","清华大学","上海交大","复旦大学","武汉大学","浙江大学","中国人大",
"南京大学","吉林大学","中山大学","北京师大","华中科大","四川大学","中国科大",
"南开大学","西安交大","厦门大学","哈工大","同济大学","长江师范","天津大学",
"华东师范","东南大学","中国农大","华南理工","湖南大学","大连理工","北京理工",
"中国矿大","华中师大","西北大学","兰州大学","华东理工","电子科大","长安大学",
"南京理工","武汉理工","西南大学","苏州大学","南京师范","云南大学","河南大学",
"陕西师范","中南财大","上海大学","上海财经","山西大学","福州大学","南昌大学",
"华南农大","新疆大学","安徽大学","南洋理工","海南大学","东北林大","福建师范",
"贵州大学","宁夏大学","河北大学","昆明理工","扬州大学","燕山大学","浙江师范",
"山东师范","天津医大","西南政法","上海理工","山东农大","上海师范","东北财大",
"湖南农大","天津师范","江西师范","西安理工","西藏大学","福建农大","中北大学",
"南京林大","长沙理工","青岛大学","成都理工","河北农大","沈阳农大","河南农大",
"河南理工","兰州理工","河南师范","浙江理工","广西师范","江西财大","安徽医大",
"杭州师范","华侨大学","安徽农大","四川师范","吉林农大","温州医大","南京邮大",
"汕头大学","贵州师范","山西师范","长江大学","西安科大","淮北师范","吉首大学",
"外交学院","集美大学","西安美院","大连大学","东华理工","西安邮大","北华大学",
"烟台大学","聊城大学","宁夏医大","重庆大学","东北大学","四川农大","东北农大",
"华中农大","北京交大","南京农大","西南交大","郑州大学","华南师范","江苏大学",
"江南大学","东华大学","辽宁大学","中央财大","深证大学","广西大学","鲁东大学",
"安徽师范","湖北大学","延边大学","青海大学","山东科大","河北师范","温州大学",
"长春理工","宁波大学","河北医大","兰州交大","青岛科大","云南师范","武汉纺织",
"辽宁师范","沈阳工大","广州大学",
};

static char city[200][20] = {
"北京","天津","沈阳","长春","哈尔滨","上海","南京","武汉","广州","重庆",
"成都","西安","石家庄","唐山","太原","包头","大连","鞍山","抚顺","吉林",
"涪陵","徐州","杭州","福州","南昌","济南","青岛","淄博","南川","郑州",
"贵阳","昆明","邯郸","保定","张家口","秦皇岛","邢台","承德","沧州","三门峡",
"大同","武隆","本溪","丹东","锦州","阜新","辽阳","鸡西","鹤岗","大庆",
"伊春","无锡","常州","苏州","宁波","合肥","淮南","淮北","厦门","枣庄",
"烟台","潍坊","泰安","临沂","开封","洛阳","顶山","安阳","新乡","焦作",
"黄石","襄樊","荆州","湘潭","深圳","汕头","湛江","南宁","柳州","西宁",
"廊坊","衡水","阳泉","黄山","长治","乌海","赤峰","营口","盘锦","朝阳",
"四平","铁岭","辽源","通化","白山","松原","白城","南通","连云港","淮阴",
"盐城","扬州","镇江","泰州","温州","嘉兴","湖州","绍兴","台州","芜湖",
"蚌埠","马鞍山","铜陵","安庆","阜阳","泉州","漳州","南平","龙岩","景德镇",
"萍乡","九江","新余","东营","济宁","威海","日照","莱芜","德州","鹤壁",
"许昌","漯河","南阳","商丘","十堰","宜昌","鄂州","荆门","孝感","黄冈",
"岳阳","常德","益阳","郴州","永州","怀化","韶关","珠海","佛山","江门",
"潮州","桂林","梧州","贵港","海口","自贡","攀枝花","泸州","德阳","绵阳",
"六盘水","遵义","曲靖","铜川","宝鸡","咸阳","汉中","白银","天水","银川",
"黑河","宿迁","金华","衢州","舟山"};

static char surname[100][4] ={
"赵","钱","孙","李","周","吴","郑","王","冯","陈",
"褚","卫","蒋","沈","韩","杨","朱","秦","尤","许",
"何","吕","施","张","孔","曹","严","华","金","魏",
"陶","姜","戚","谢","邹","喻","柏","窦","章","云",
"苏","潘","葛","奚","范","彭","郎","姚","鲁","韦",
"昌","马","苗","凤","花","方","俞","任","袁","柳",
"鲍","史","唐","费","廉","岑","薛","雷","贺","倪",
"汤","滕","殷","罗","毕","郝","邬","安","常","乐",
"于","时","傅","皮","卞","齐","康","伍","余","元",
"卜","顾","孟","平","黄","和","穆","萧","尹"};

static char major[100][40] = {
"新闻学","广告学","传播学","历史学","考古学","应用数学","物理学","应用物理学",
"化学","天文学","地理信息科学","海洋科学","地质学","地球化学","生物科学",
"生物技术","生物信息学","心理学","统计学","工程力学","机械工程","工业设计",
"控制工程","远教工程","测控技术","材料物理","材料化学","教育学",
"汉语言","英语","冶金工程","高分子材料","复合材料","能源与动力",
"机械电子工程","电气工程","信息工程","自动化","中医学","口腔医学",
"电子信息工程","电子科学","通信工程","微电子科学","光电信息科学",
"药学","法医学","工程管理","会计学","市场营销","计算机科学","软件工程",
"网络工程","信息安全","物联网工程","数字媒体技术","土木工程","建筑电气",
"采矿工程","石油工程","给排水工程","水利水电工程","测绘工程","化学工程",
"制药工程","地质工程","核工程","农业工程","深林工程","林产化工","社会学",
"软化工程","包装工程","交通运输","交通工程","船海技术","轮机工程","飞行技术",
"船舶与海洋工程","车辆工程","预防医学","财务管理","国际商务","人力资源",
"审计学","哲学","逻辑学","宗教学","经济学","经济统计学"};

static char birth[60][10];

int main()
{
      int i, j = 0;
      int birthday = 1942;
      char line[81], line1[80];
      FILE *ori, *word;

      for( i = 0; i < 55; i++)
      {
            birthday++;
            sprintf( birth[i],"%d%s",birthday,"年");
      }	
      if( (ori = fopen("original2.txt","w")) == NULL )
      {
            printf("failed to open file!");
            return 0;
      }
      if( (word = fopen("keyword.txt","w")) == NULL )
      {
            printf("failed to open file!");
            return 0;
      }
      for( ; j < 200000; j++ )
      {
            memset( line, 0, 80);
            sprintf( line, "# %s # %s # %s # %s # %s\n", surname[j%99],birth[j%55],city[j%175],college[j%150],major[j%90] );
            fputs( line, ori);
      }
      for( i = 0; i < 99; i++ )
      {
            memset( line, 0, 80);
	    sprintf( line1, "%s\n", surname[i] );
            fputs( line1, word);
      } 
      for( i = 0; i < 55; i++ )
      {
            memset( line, 0, 80);
	    sprintf( line1, "%s\n", birth[i] );
            fputs( line1, word);
      }
      for( i = 0; i < 175; i++ )
      {
            memset( line, 0, 80);
	    sprintf( line1, "%s\n", city[i] );
            fputs( line1, word);
      } 
      for( i = 0; i < 150; i++ )
      {
            memset( line, 0, 80);
	    sprintf( line1, "%s\n", college[i] );
            fputs( line1, word);
      }
      for( i = 0; i < 90; i++ )
      {
            memset( line, 0, 80);
	    sprintf( line1, "%s\n", major[i] );
            fputs( line1, word);
      }
      fclose( ori );
      fclose( word );
      return 0;
}
